opensource-apple/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_RootHub.cpp
    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::GetRootHubStringDescriptor(UInt8	index, OSData *desc)
{
	
    // The following strings are in Unicode format
    //
    UInt8 productName[] = {
		0,			// Length Byte
		kUSBStringDesc,	// Descriptor type
		0x45, 0x00, // "E"
		0x48, 0x00, // "H"
		0x43, 0x00, // "C"
		0x49, 0x00, // "I"
		0x20, 0x00,	// " "
		0x52, 0x00,	// "R"
		0x6F, 0x00,	// "o"
		0x6f, 0x00,	// "o"
		0x74, 0x00,	// "t"
		0x20, 0x00,	// " "
		0x48, 0x00,	// "H"
		0x75, 0x00,	// "u"
		0x62, 0x00,	// "b"
		0x20, 0x00,	// " "
		0x53, 0x00, // "S"
		0x69, 0x00,	// "i"
		0x6d, 0x00,	// "m"
		0x75, 0x00,	// "u"
		0x6c, 0x00,	// "l"
		0x61, 0x00,	// "a"
		0x74, 0x00,	// "t"
		0x69, 0x00,	// "i"
		0x6f, 0x00,	// "o"
		0x6e, 0x00,	// "n"
	};
	
    UInt8 vendorName[] = {
		0,			// Length Byte
		kUSBStringDesc,	// Descriptor type
		0x41, 0x00,	// "A"
		0x70, 0x00,	// "p"
		0x70, 0x00,	// "p"
		0x6c, 0x00,	// "l"
		0x65, 0x00,	// "e"
		0x20, 0x00,	// " "
		0x43, 0x00,	// "C"
		0x6f, 0x00,	// "o"
		0x6d, 0x00,	// "m"
		0x70, 0x00,	// "p"
		0x75, 0x00,	// "u"
		0x74, 0x00,	// "t"
		0x65, 0x00,	// "e"
		0x72, 0x00,	// "r"
		0x2c, 0x00,	// ","
		0x20, 0x00,	// " "
		0x49, 0x00,	// "I"
		0x6e, 0x00,	// "n"
		0x63, 0x00,	// "c"
		0x2e, 0x00	// "."
	};
	
    // According to our device descriptor, index 1 is product, index 2 is Manufacturer
    //
    if ( index > 2 )
        return kIOReturnBadArgument;
	
    // Set the length of our strings
    //
    vendorName[0] = sizeof(vendorName);
    productName[0] = sizeof(productName);
    
    if ( index == 1 )
    {
        if (!desc)
            return kIOReturnNoMemory;
		
        if (!desc->appendBytes(&productName,  productName[0]))
            return kIOReturnNoMemory;
    }
    
    if ( index == 2 )
    {
        if (!desc)
            return kIOReturnNoMemory;
		
        if (!desc->appendBytes(&vendorName,  vendorName[0]))
            return kIOReturnNoMemory;
    }
    
    return kIOReturnSuccess;
}



AbsoluteTime	
AppleUSBEHCI::LastRootHubPortStatusChanged( bool resetTime )
{
    if ( resetTime )
        clock_get_uptime(&_lastRootHubStatusChanged);
	
    return _lastRootHubStatusChanged;
}



void
AppleUSBEHCI::GetNumberOfPorts( UInt8 * numPorts )
{
    UInt32		descriptorA;
	
    if ( _ehciBusState == kEHCIBusStateOff )
    {
		*numPorts = 0;
    }
    else
    {
		*numPorts = USBToHostLong(_pEHCICapRegisters->HCSParams) & kEHCINumPortsMask;
    }
}



bool	
AppleUSBEHCI::RootHubAreAllPortsDisconnectedOrSuspended( )
{
    UInt8	numPorts = 0;
    UInt32	portStat;
    int		i;
    bool	result = true;
	
    GetNumberOfPorts( &numPorts );
	
    if ( numPorts == 0 )
        return false;
	
    for (i=0; i < numPorts; i++)
    {
		portStat = USBToHostLong(_pEHCIRegisters->PortSC[i]);
		if ((portStat & kEHCIPortSC_Enabled) && !(portStat & kEHCIPortSC_Suspend))
		{
			USBLog(6, "AppleUSBEHCI[%p]::RootHubAreAllPortsDisconnectedOrSuspended - port %d enabled and not suspended",  this, i+1);
			result = false;
		}
		if ((portStat & kEHCIPortSC_Connect) && !(portStat & kEHCIPortSC_Suspend))
		{
			USBLog(6, "AppleUSBEHCI[%p]::RootHubAreAllPortsDisconnectedOrSuspended - port %d CONNECTED, NOT ENABLED and not suspended - we used to allow this but no more",  this, i+1);
			USBLog(7, "AppleUSBEHCI::RHAPDOS: USBCMD(%p) USBSTS(%p) USBIntr(%p) PortSC(%p %p %p %p %p)",
					 (void*)USBToHostLong(_pEHCIRegisters->USBCMD),
					 (void*)USBToHostLong(_pEHCIRegisters->USBSTS),
					 (void*)USBToHostLong(_pEHCIRegisters->USBIntr),
					 (void*)USBToHostLong(_pEHCIRegisters->PortSC[0]),
					 (void*)USBToHostLong(_pEHCIRegisters->PortSC[1]),
					 (void*)USBToHostLong(_pEHCIRegisters->PortSC[2]),
					 (void*)USBToHostLong(_pEHCIRegisters->PortSC[3]),
					 (void*)USBToHostLong(_pEHCIRegisters->PortSC[4]));
							
			return false;
		}
    }
	
	// If we have pending bulk or control transactions, then force the result to false
	if ( result )
	{
		if ( _controlBulkTransactionsOut != 0 )
		{
            USBLog(2, "AppleUSBEHCI[%p]::RHAreAllPortsDisconnectedOrSuspended  everything disconnected, but %ld control/bulk transactions are pending. ", this, _controlBulkTransactionsOut);
			result = false;
		}
	}

	USBLog(6, "AppleUSBEHCI[%p]::RootHubAreAllPortsDisconnectedOrSuspended - YES THEY ARE",  this);
    return result;
}



void
AppleUSBEHCI::PortDetectInterruptThreadEntry(OSObject *target)
{
    AppleUSBEHCI *					me = OSDynamicCast(AppleUSBEHCI, target);
	
    if (!me )
        return;
	
    me->retain();
    me->PortDetectInterruptThread();
    me->release();
}



void
AppleUSBEHCI::PortDetectInterruptThread()
{
    UInt8						numPorts = 0;
    UInt32						hcsParams;
	UInt32						portSC = 0;
    unsigned int				port;
	
	hcsParams = USBToHostLong(_pEHCICapRegisters->HCSParams);
	numPorts = hcsParams & kEHCINumPortsMask;
	
	USBLog(5,"AppleUSBEHCI[%p]::PortDetectInterruptThread numPorts %d",  this, numPorts);
	
	for (port = 1; port <= numPorts; port++)
	{
		portSC = USBToHostLong (_pEHCIRegisters->PortSC[port-1]);
        if (portSC & kEHCIPortSC_Resume) 
		{
            USBLog(3, "AppleUSBUHCI[%p]::PortDetectInterruptThread - resume detected on port %d, resuming", this, port);
			if ( _idleSuspend )
			{
				USBLog(3, "AppleUSBUHCI[%p]::PortDetectInterruptThread  - restarting bus before resuming port",  this);
				setPowerState(kEHCISetPowerLevelRunning, this);
			}
            EHCIRootHubPortSuspend(port, false);
        } 
	}
	
	if ( _idleSuspend )
	{
		USBLog(2, "AppleUSBEHCI[%p]::PortDetectInterruptThread - port change detect interrupt while in idlesuspend - restarting bus",  this);
		setPowerState(kEHCISetPowerLevelRunning, this);
	}
	
	UIMRootHubStatusChange();
}



void
AppleUSBEHCI::RootHubCreationEntry(OSObject *target)
{
    AppleUSBEHCI *			me = OSDynamicCast(AppleUSBEHCI, target);
	
    if (!me )
        return;
	
    me->retain();
    me->RootHubCreation();
    me->release();
}



void
AppleUSBEHCI::RootHubCreation()
{
	IOReturn		err;
	
	USBLog(1,"AppleUSBEHCI[%p]::RootHubCreation - Need to recreate root hub on bus %ld", this, _busNumber);
		
	USBLog(2,"AppleUSBEHCI[%p]::RootHubCreation - powering up hardware", this);
	
	// Initialize our hardware
	//
	UIMInitializeForPowerUp();
	
	_ehciBusState = kEHCIBusStateRunning;
	_ehciAvailable = true;										// tell the interrupt filter routine that we are on
	_wakingFromHibernation = false;
	
	if ( _rootHubDevice == NULL )
	{
		err = CreateRootHubDevice( _device, &_rootHubDevice );
		USBLog(1,"AppleUSBEHCI[%p]::RootHubCreation - done creating root hub", this);
		if ( err != kIOReturnSuccess )
		{
			USBError(1,"AppleUSBEHCI[%p]::RootHubCreation - Could not create root hub device upon wakeup (%x)!", this, err);
		}
		else
		{
			_rootHubDevice->registerService(kIOServiceRequired | kIOServiceSynchronous);
			LastRootHubPortStatusChanged(true);
		}
	}
	_companionWakeHoldoff = false;
	return;
}



